src/cf/Documents/ЗаключениеМедицинскойКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаключениеМедицинскойКомиссии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаМедосмотр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаМедосмотр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДопусковСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскоеЗаключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/РеестрЗаявокНаМедосмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗаявокНаМедосмотр</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаключениеМедКомиссии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеМедицинскойКомиссии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаМедосмотр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаМедосмотр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыДопусковСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДопусковСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Допущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДопущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопущенСОграничениями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗаключениеМедицинскойКомиссии/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий		  
		  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаМедосмотр") Тогда
		ЗаявкаНаМедосмотр = ДанныеЗаполнения;
		Пациент           = ДанныеЗаполнения.Пациент;
		ТипДопуска        = Перечисления.ТипыДопусковСотрудников.Допущен;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр КАК ЗаявкаНаМедосмотр,
	|	РеестрЗаявок.Пациент КАК Пациент,
	|	РеестрЗаявок.ДатаЗаявки КАК ДатаЗаявки,
	|	РеестрЗаявок.КрайнийСрок КАК КрайнийСрок
	|ИЗ
	|	РегистрСведений.РеестрЗаявокНаМедосмотр КАК РеестрЗаявок
	|ГДЕ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр = &ЗаявкаНаМедосмотр
	|	И РеестрЗаявок.Пациент = &Пациент";
	
	Запрос.УстановитьПараметр("ЗаявкаНаМедосмотр", ЗаявкаНаМедосмотр);
	Запрос.УстановитьПараметр("Пациент"          , Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
        ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.ЗаключениеМедКомиссии = Ссылка;
		МЗ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
